Controller/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "choco browni"], ["price", 40.0], ["created_at", "2023-03-13 09:59:27.332048"], ["updated_at", "2023-03-13 09:59:27.332048"]]
---
    def create
        @product = Product.new(product_params)
        if @product.save

SELECT "products".* FROM "products" WHERE (name LIKE '%%')
---
    def search
        @search_query = params[:search_query]
        @products = Product.where("name LIKE ?", "%#{@search_query}%")