Controller/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Ridham1511"], ["password_digest", "[FILTERED]"], ["role", "admin"], ["created_at", "2023-03-15 05:17:11.634233"], ["updated_at", "2023-03-15 05:17:11.634233"]]